tap "homebrew/bundle"
tap "homebrew/services"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: false

brew "bash"
brew "bat"
brew "docker"
brew "ente-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gum"
brew "jj"
brew "jq"
brew "just"
brew "mas"
brew "neovim"
brew "ollama"
brew "pandoc"
brew "poppler"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stow"
brew "tmux"
brew "wget"

cask "balenaetcher"
cask "font-atkinson-hyperlegible"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "keymapp"
cask "mixxx"
cask "obsidian"
cask "orcaslicer"
cask "proton-drive"
cask "proton-pass"
cask "raycast"
cask "readwise-ibooks"
cask "rectangle-pro"
cask "vivaldi"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zen-browser"

mas "Proton Pass for Safari", id: 6502835663
mas "AdGuard for Safari", id: 1440147259
mas "Noir", id: 1592917505
mas "Pages", id: 409201541
