tap "anomalyco/tap"
tap "netbirdio/tap"

brew "anomalyco/tap/opencode"
brew "bash"
brew "bat"
brew "dua-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "glow"
brew "gnupg"
brew "jq"
brew "neovim"
brew "netbirdio/tap/netbird"
brew "pandoc"
brew "pinentry-mac"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stow"
brew "tmux"
brew "ykman"

# dev tools
brew "goose"
brew "mise"
brew "tailwindcss"

cask "bambu-studio"
cask "coderabbit"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "inkscape"
cask "localsend"
cask "obsidian"
cask "orbstack"
cask "orcaslicer@nightly"
cask "proton-mail"
cask "proton-pass"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle-pro"
cask "signal"
cask "yubico-authenticator"
