# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: false

brew "ansible"
brew "ansible-lint"
brew "bash"
brew "bat"
brew "docker"
brew "dopplerhq/cli/doppler"
brew "dua-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "glow"
brew "jj"
brew "jq"
brew "just"
brew "neovim"
brew "netbirdio/tap/netbird"
brew "opencode"
brew "pandoc"
brew "pieces-cli"
brew "poppler"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stow"
brew "tmux"

cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "helium-browser"
cask "inkscape"
cask "localsend"
cask "obsidian"
cask "orbstack"
cask "orcaslicer"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle-pro"
cask "yubico-authenticator"
cask "zen"
