brew "bash"
brew "bat"
brew "colima"
brew "docker"
brew "docker-compose"
brew "doggo"
brew "dua-cli"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "herdr"
brew "infisical/get-cli/infisical"
brew "jq"
brew "just"
brew "mise"
brew "mole"
brew "mosh"
brew "neovim"
brew "netbirdio/tap/netbird"
brew "ollama"
brew "pandoc"
brew "playwright-cli"
# podman: installed via the official .pkg (see justfile `podman-init`); Podman
# does not recommend the Homebrew formula. colima/docker above cover Docker compat.
brew "poppler"
brew "proton-pass-cli"
brew "qpdf"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stow"
brew "tmux"
brew "tree-sitter-cli"

# --- agents (brew-managed) --------------------------------------------------
# t3 is the only non-brew agent; it's a pnpm global (see justfile `pnpm-globals`).
cask "codex"
cask "claude-code@latest"
cask "cursor-cli", args: { no_quarantine: true }
brew "pi-coding-agent"
brew "anomalyco/tap/opencode"
cask "coderabbit"  # AI code review CLI
# ---------------------------------------------------------------------------

cask "brave-browser"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "navigator"
cask "proton-pass"
cask "raycast"
cask "rustdesk"
cask "shapr3d"
cask "zed"
